<?php

return [
    'email_address' => 'អាសយដ្ឋានអ៊ីម៉ែល',
    'password' => 'ពាក្យសម្ងាត់',
    'email_required' => 'សូមបំពេញអាសយដ្ឋានអ៊ីម៉ែល។',
    'email_invalid' => 'អាសយដ្ឋានអ៊ីម៉ែលនេះមិនត្រឹមត្រូវទេ។',
    'password_required' => 'សូមបំពេញពាក្យសម្ងាត់។',
    'login_failed' => 'ពាក្យសម្ងាត់មិនត្រឹមត្រូវ។',
    'welcome' => 'សូមស្វាគមន៍, :name!',
    'logout_success' => 'លោកអ្នកបានចាកចេញដោយជោគជ័យ។ សូមអរគុណ។',
    'no_permission_cash_transaction' => 'លោកអ្នកមិនមានសិទ្ធិចូលប្រើប្រតិបត្តិការ​សាច់ប្រាក់ទេ។',
];
