<?php

return [
    'type' => 'ប្រភេទ',
    'category' => 'ប្រភេទ',
    'category_income' => 'ប្រភេទចំណូល',
    'category_expense' => 'ប្រភេទចំណាយ',
    'date' => 'កាលបរិច្ឆេទ',
    'income' => 'ចំណូល',
    'expense' => 'ចំណាយ',
    'select_type' => 'ជ្រើសរើសប្រភេទ',
    'select_category' => 'ជ្រើសរើសប្រភេទចំណាយ',
    'room_fee' => 'ថ្លៃជួលបន្ទប់',
    'electricity' => 'ថ្លៃអគ្គិសនី',
    'water' => 'ថ្លៃទឹក',
    'salary' => 'ប្រាក់ខែ',
    'other' => 'ផ្សេងៗ',
    'amount' => 'ចំនួនទឹកប្រាក់(៛)',
    'note' => 'កំណត់សម្គាល់',
    'save_transaction' => 'រក្សាទុកប្រតិបត្តិការ',
    'export' => 'ទាញយក',
    'confirm_delete' => 'តើអ្នកប្រាកដថាចង់លុបប្រតិបត្តិការនេះមែនទេ?',
    'delete_warning' => 'សកម្មភាពនេះមិនអាចត្រឡប់វិញបានទេ។',

    // Validation Messages
    'transaction_date_required' => 'សូមបញ្ចូលកាលបរិច្ឆេទប្រតិបត្តិការ។',
    'type_required' => 'សូមជ្រើសរើសប្រភេទប្រតិបត្តិការ។',
    'category_required' => 'សូមជ្រើសរើសប្រភេទចំណាយ ឬចំណូល។',
    'amount_required' => 'សូមបញ្ចូលចំនួនទឹកប្រាក់។',
    'amount_must_be_number' => 'ចំនួនទឹកប្រាក់ត្រូវតែជាលេខត្រឹមត្រូវ។',
    'amount_min' => 'ចំនួនទឹកប្រាក់ត្រូវតែធំជាង 0.01។',

    // API / Status Messages
    'saved_successfully' => 'បានរក្សាទុកប្រតិបត្តិការ​ដោយជោគជ័យ។',
    'failed_to_save' => 'ការរក្សាទុកប្រតិបត្តិការ​បានបរាជ័យ។',

     // 💾 ប៊ូតុង
    'add_transaction' => 'បន្ថែមប្រតិបត្តិការ',
    'save_all' => 'រក្សាទុកទាំងអស់',
    'save_all_transactions' => 'រក្សាទុកប្រតិបត្តិការទាំងអស់',

    // ✅ សារជោគជ័យ / បរាជ័យ
    'added_to_list' => 'បានបន្ថែមប្រតិបត្តិការទៅក្នុងបញ្ជីដោយជោគជ័យ។',
    'removed_from_list' => 'បានលុបប្រតិបត្តិការចេញពីបញ្ជី។',
    'income_list' => 'បញ្ជីចំណូល',
    'expense_list' => 'បញ្ជីចំណាយ',
    'no_data' => 'មិនមានទិន្នន័យ។',

    //filter
    'from_date' => 'ពីកាលបរិច្ឆេទ',
    'to_date' => 'ដល់កាលបរិច្ឆេទ',
    'select_date' => 'ជ្រើសរើសកាលបរិច្ឆេទ',
    'search_category' => 'ស្វែងរកប្រភេទ...',
    'filter' => 'ស្វែងរក',
    'reset' => 'សម្អាត',

    'select' => 'សូមជ្រើសរើស',
    'location' => 'ទីតាំង',
    'select_location' => 'ជ្រើសរើសទីតាំង',

    'total' => 'ចំនួនទឹកប្រាក់សរុប(៛)'
];
