<?php

return [
    // Field Labels
    'name' => 'ប្រភេទបន្ទប់',
    'size' => 'ទំហំបន្ទប់',
    'price' => 'តម្លៃ(៛)',
    'description' => 'ពិពណ៌នា',
    'save' => 'រក្សាទុក',
    'select_roomtype' => 'ជ្រើសរើសប្រភេទបន្ទប់',
    'updated_successfully' => 'បានធ្វើបច្ចុប្បន្នភាពប្រភេទបន្ទប់ដោយជោគជ័យ។',
    'update_failed' => 'ការធ្វើបច្ចុប្បន្នភាពប្រភេទបន្ទប់បរាជ័យ។',

    // Validation Messages
    'name_required' => 'សូមបញ្ចូលឈ្មោះប្រភេទបន្ទប់។',
    'name_string' => 'ឈ្មោះប្រភេទបន្ទប់ត្រូវតែជាអក្សរ។',
    'name_max' => 'ឈ្មោះប្រភេទបន្ទប់មិនអាចលើសពី 255 តួអក្សរ។',

    'size_required' => 'សូមបញ្ចូលទំហំបន្ទប់។',
    'size_string' => 'ទំហំបន្ទប់ត្រូវតែជាអក្សរ។',
    'size_max' => 'ទំហំបន្ទប់មិនអាចលើសពី 100 តួអក្សរ។',

    'price_required' => 'សូមបញ្ចូលតម្លៃ។',
    'price_numeric' => 'តម្លៃត្រូវតែជាលេខ។',
    'price_min' => 'តម្លៃត្រូវតែមានយ៉ាងតិច 0។',

    'description_string' => 'ពិពណ៌នាត្រូវតែជាអក្សរ។',
    'description_max' => 'ពិពណ៌នាមិនអាចលើសពី 1000 តួអក្សរ។',
];
