<?php

return [
    'personalize' => 'ការកំណត់ផ្ទាល់ខ្លួន',
    'theme_mode' => 'រូបរាង',
    'theme_mode_hint' => 'សូមជ្រើសរើសរូបរាងនៃប្រព័ន្ធ (ភ្លឺ ឬ ងងឹត)',
    'light' => 'ភ្លឺ',
    'dark' => 'ងងឹត',

    'color' => 'ពណ៌',
    'color_hint' => 'ជ្រើសរើសពណ៌សំខាន់នៃប្រព័ន្ធ។',

    'font' => 'ប្រភេទអក្សរ',
    'font_hint' => 'ជ្រើសរើសប្រភេទអក្សរដែលចង់ប្រើ។',

    'theme_base' => 'បែបផែនប្រព័ន្ធ',
    'theme_base_hint' => 'ជ្រើសរើសស្រមោលប្រផេះសម្រាប់ប្រព័ន្ធ។',

    'corner_radius' => 'រាងមូលជ្រុង',
    'corner_radius_hint' => 'ជ្រើសរើសកម្រិតមូលនៃជ្រុងនៃកម្មវិធី។',

    'language' => 'ភាសា',
    'language_hint' => 'ជ្រើសរើសភាសារបស់អ្នក។',

    'reset' => 'កំណត់ឡើងវិញទៅដើម',
];
